{"ingredients":["2 cups dried chickpeas","1 yellow onion, coarsely chopped","3 cloves garlic, coarsely chopped","1 Tbsp coriander seed, lightly crushed","1.5 tsp salt","1/2 tsp ground cumin","1/2 tsp black pepper","2 cups packed cilantro leaves","2 cups packed parsley (no long stems)","Canola oil, for frying","Serve on pita, on a pile of greens, or with spicy harissa or creamy tahini"],"steps":["In a mixing bowl, soak the chickpeas overnight (cover by a few inches). Drain in a colander","Split the ingredients into two batches","\u003e Combine onion and garlic in a food processor until finely chopped","\u003e Add the coriander and drained chickpeas. Pulse until the chickpeas are just reduced to smaller chunks. Shove the mixture around with a spatula","\u003e Add the salt, cumin and pepper. Process until the mixture is finely chopped but not pureed, stopping to scrape down the sides.","\u003e The mixture should resemble coarse meal, not a smooth hummus. It should mostly hold together when you press a clump in your hands","\u003e Add the cilantro and parsley to the food processor. Pulse until the herbs are finely chopped and evenly distributed","\u003e Test the mixture again by trying to shape it into a mound. Continue to process until it keeps its shape.","Use a 1.5-inch ice cream scoop or your hands to form a total of 30-40 slightly mounded disks that are about 1.5 inches wide. (If using a scoop, gently flatten them a bit with your hands \u0026ndash; helps to promote even cooking better than a ball)","Baking","\u003e To bake the falafel, place them on a rimmed baking sheet generously slicked with olive oil. Bake at 375 degrees for about 30 minutes, or until browned and crisped, flipping them over halfway through","(Alternatively) Frying","\u003e When ready to fry, heat 2 inches of oil in a deep, heavy pot over medium heat (375 degrees)","\u003e \u003e Line a baking sheet with paper towels, then seat a wire cooling rack on top.","\u003e Carefully add 6-8 falafel at a time to the hot oil; cook for 60-90 seconds, or until browned and cooked through","\u003e \u003e Use a slotted spoon to transfer them to the rack to drain. Repeat to cook all the falafel, making sure the oil returns to the proper temperature before adding the next batch."],"title":"Crispy Herbed Falafel"}