{
  "ingredients": [
    "2 large eggs",
    "1 1/4 cups milk*",
    "3 tablespoons melted butter or vegetable oil",
    "1 1/2 cups King Arthur Unbleached All-Purpose Flour",
    "3/4 teaspoon salt",
    "2 teaspoons baking powder",
    "2 tablespoons sugar OR 1/4 cup malted milk powder"
  ],
  "notes": [
    "*Use 1 cup milk if you're baking under hot, humid conditions, or if you're going to let the batter rest longer than 15 minutes. Use up to 1 1/4 cups milk in cold, dry conditions",
    "To make waffles, substitute 2 tablespoons melted butter or vegetable oil for 2 tablespoons of the milk. Cook waffles as directed with your waffle iron. Hint - if you try to open the iron and it doesn't open easily, the waffle isn't done yet.",
    "For a whole grain breakfast treat, replace 1/2 cup of the all-purpose flour with 1/2 cup of ground oats.",
    "A grated apple mixed into the batter will keep the pancakes moist longer if you need to cook them ahead and bring them to the table all at once",
    "For blueberry pancakes, sprinkle fresh or thawed frozen blueberries over the batter after you pour it on the griddle. Mixing frozen blueberries into the batter before scooping will turn it blue and streaky."
  ],
  "rating": 2,
  "recipe": [
    "Beat the eggs and milk until light and foamy, about 3 minutes at high speed of a stand or hand mixer. Stir in the butter or vegetable oil",
    "Whisk the dry ingredients together to evenly distribute the salt, baking powder and sweetener",
    "Gently and quickly mix into the egg and milk mixture. Let the batter rest for at least 15 minutes, while the griddle is heating; it'll thicken slightly",
    "Heat a heavy frying pan over medium heat, or set an electric griddle to 375F. Lightly grease frying pan or griddle. The pan or griddle is ready if a drop of water will skitter across the surface, evaporating immediately",
    "Drop 1/4 cupfuls of batter onto the lightly greased griddle. Bake on one side until bubbles begin to form and break, about 2 minutes; then turn the pancakes and cook the other side until brown, about 1 1/2 to 2 minutes. Turn over only once"
  ],
  "source": "https://www.kingarthurflour.com/recipes/simply-perfect-pancakes-recipe"
}
