{
  "ingredients": {
    "1. BROWNIE LAYER": [
      "1/2 cup butter, melted",
      "1 cup sugar",
      "1 cup unsweetened cocoa powder",
      "1/4 teaspoon salt",
      "1/2 teaspoon vanilla",
      "2 eggs",
      "1/2 cup flour"
    ],
    "2. CARAMEL LAYER": [
      "25-30 caramels, unwrapped (I used about 1 cup of Werther’s.)",
      "2 tablespoons heavy cream"
    ],
    "3. COOKIE DOUGH LAYER": [
      "1/2 cup butter, at room temperature",
      "1/4 cup sugar",
      "1/2 cup brown sugar",
      "2 tablespoons heavy cream",
      "1/2 teaspoon vanilla",
      "3/4 cup flour",
      "1/4 teaspoon salt",
      "1/2 cup mini semi-sweet chocolate chips"
    ],
    "4. CHOCOLATE GLAZE": [
      "8 ounces semi-sweet chocolate, chopped",
      "1 tablespoons vegetable oil (I used canola oil)"
    ]
  },
  "notes": [
    "Cut with a hot dry knife before serving. Keep refrigerated in one layer as the caramel layer will start to ooze as these come to room temperature"
  ],
  "rating": 0,
  "recipe": [
    "Preheat oven to 325F, line an 8×8 inch pan with non-stick foil or use regular foil and spray with non-stick spray",
    ">> Brownie Batter",
    "Cream together butter and sugar in a large bowl. Mix in cocoa powder and salt. Add vanilla and eggs and mix until smooth. Mix in flour until incorporated. Spread brownie batter in prepared pan. Bake 15 minutes",
    "In microwave safe bowl, add caramels and heavy cream. Microwave for 60 seconds, stir, then repeat at 30 second intervals until melted and smooth. Pour caramel mixture over brownie layer. Put the pan in the fridge to chill until cookie dough layer is ready",
    ">> Cookie Dough Layer",
    "Cream together butter and sugars until light and fluffy. Mix in vanilla and heavy cream. Add flour and salt and mix until incorporated. Stir in mini chocolate chips. When caramel layer is firm, carefully spread the cookie dough on top",
    ">> Chocolate Glaze",
    "In a microwave safe bowl combine chocolate chocolate and oil. Microwave for 60 seconds, then stop and stir. Repeat using 30 second intervals till melted and smooth. Spread chocolate over cookie dough layer. Chill for easier cutting. Serve at room temperature"
  ],
  "source": "https://www.thatskinnychickcanbake.com/cookie-dough-billionaire-bars/"
}
