{
  "ingredients": [
    "4 large eggs, room temperature",
    "1 tsp vanilla extract",
    "1.75 cups flour",
    "1/4 cup unsweetened cocoa powder",
    "1.5 tsp baking powder",
    "1 tsp kosher salt",
    "1 tsp flaky sea salt",
    "1/2 cup canola or sunflower oil",
    "1.75 cups granulated sugar",
    "4 ounces unsweetened chocolate, chopped and melted",
    "1 cup confectioners sugar",
    "35 to 42 regular size marshmallows"
  ],
  "notes": [
    "Bottom rack for 6 minutes and top rack for 2 minutes. Use smaller marshmallows"
  ],
  "rating": 1,
  "recipe": [
    ">> Make ahead: prep the dough and refrigerate for 30 minutes - overnight",
    "In a measuring cup, whisk together the eggs and vanilla extract",
    "In a medium bowl, whisk together the flour, cocoa powder, baking powder, and both salts",
    "In a large bowl, combine the oil and granulated sugar with an electric mixer on medium speed to blend well, then add the egg-vanilla mixture in 3 additions and the melted chocolate. Stop to scrape down the bowl",
    "Add the flour mixture and beat for about 30 seconds on low speed or just long enough to form a dough that looks like brownie batter. Do not over-mix",
    "Gather the dough together, wrap it in plastic wrap and refrigerate for at least 30 minutes, or up to overnight",
    "Position racks in the upper and lower thirds of the oven; preheat to 350F. Line two large baking sheet with parchment paper or silicone liners. Sift the confectioners’ sugar into a quart-size zip-top bag",
    "Working with 4 or 5 at a time, drop heaping tablespoonfuls of dough into the bag (or use a #40 disher), then shake gently until thoroughly coated. Shake off any excess sugar, then arrange them on the baking sheets spaced 2 inches apart",
    "Press on the top of each one to form a large thumbprint indentation, then press a marshmallow into the indentation.",
    "Start one sheet on the bottom rack for 6-8 minutes, then move to the top rack for 2 minutes [FYI: WaPo suggested 8 min. then 4-6, which appeared to be too long]. The cookies should develop cracks/crinkles and the marshmallow should expand",
    "Let cool on the baking sheet for 2 minutes, then transfer the cookies to a wire rack to cool completely before serving or storing"
  ],
  "source": "https://www.washingtonpost.com/recipes/toasted-marshmallow-brownie-krinkles/16191/?utm_term=.d8bf01e84ac3"
}
