{"ingredients":["8 g instant yeast","375 g water","500 g all purpose flour","10 g salt"],"steps":["Find the ambient temperature, which can be done by taking the temperature of the flour when sitting at room temperature","Calculate the desired water temperature based on the equation below. This dough should be at 76F","\u003e The water temperature can be achieved by filling a jar with hot top water, then using a second cup full of cold water. Slowly add the cold water until at the ideal temperature","Weigh all ingredients separately using an appropriately sized bowl","Fill a large bowl with the water. Dispense the yeast in the bowl with a gentle swish. Let see for a couple of minutes until a light foam from the yeast begins to form","Add the flour on top of the water and sprinkle salt on top of the flour. It is important to keep the salt on top of the flour as it could inhibit the rise of the yeast","Mix with your hands or a wooden spoon to ensure that the ingredients are well combined. The ingredients should form a slack wet dough","Let the dough relax for 20 minutes so that the flour can absorb the water","Stretch and fold the dough. Imagine that the dough has \u0026ldquo; four corners. \u0026rdquo; Pull each up and stretch over the top of the dough to meet the opposite corner. Work your way around the corners two or three times until the dough has become a tight ball and is no longer loose and stretchy","Place a floured kitchen towel over the bowl and let rise for 90 minutes","The dough should now be lighter and filled with air bubbles. To check, pinch off a small amount of dough and drop into a cup of cold water. If the dough floats it is ready, but if not, the room might be cold and the dough could use another 30 minutes","(Stop here for focaccia. This would have been step 8 in the book)","Gently turn the dough onto a floured counter top with the sticky bottom facing up. You may need your hand or a plastic scraper to remove","Shape the dough by making a gentle letter fold","\u003e Fold the far side down to the middle to create a seam. Then fold the nearest side up to the middle seam and seal the dough against itself","\u003e Turn the turn 90 degrees and repeat so that the sticky side of the dough is completed sealed","\u003e The dough should now have a nice rounded square shape","Place the dough, seam-side down, into a basked lined with a floured kitchen towel. Let the dough proof for 60-90 minutes","While the dough is proofing, place the empty dutch oven in the oven and pre-heat to 475. Make sure that there is enough time for the oven to fully pre-heat","Check that the dough is airy like a marshmallow and when pressed leave a small indent rather than springing back up. Note that it is very common that bread needs additional time to proof","Flour your work surface and tip the loaf out of the basket, seam-side (bottom) up","Safely, move the hot dutch oven onto the stove top, placing the lid to the side. Transfer the dough into the dutch oven, seam-side up (the bread will open at the seam resulting in a classic rustic loaf)","Cover the dutch oven with the lid and return to the oven for 25 minutes","At 25 minutes, remove the lid. The pale loaf should have risen. Continue baking for 15-20 minutes uncovered","At the next check, the loaf should be golden brown and will sound hollow when thumped with your fingers","Remove the loaf and transfer to a wire rack to cool for 30 minutes to let the interior crumb set"],"title":"No Knead Bread Recipe"}